<template>
  <main class="page">
    <div class="screen">
      <Background/>
      <div class="screen__container">
        <Logo/>
        <div class="screen__body">
          <Doves/>
          <h2 class="screen__subtitle">Методы тренировок голубей</h2>
          <div class="screen__content">
            <h2 class="screen__subtitle screen__subtitle_h3">Метод Пола Сиона</h2>
            <p class="screen__text">
              Французский голубевод был сторонником отбора спортсменов в раннем годовалом возрасте. Он устраивал для молодой птицы полёты на расстояния до 600
              километров. Сион считал, что только жёсткий отбор в таком раннем возрасте ведёт к воспитанию настоящей спортивной породы голубей.
            </p>
            <p class="screen__text">
              После усиленных тренировок в первый год жизни Сион давал птице отдохнуть и вывести потомство, утверждая, что только от настоящих молодых и
              сильных спортсменов, проявивших свои уникальные полётные качества, можно получить хорошее потомство.
            </p>
            <p class="screen__text">
              Годовалая птица делала две или три кладки, выкармливая по одному птенцу. Это благотворно влияло на психологию голубей, позволяя им без стрессов
              вырастить своё потомство.
            </p>
            <p class="screen__text">
              К двум годам голуби становились зрелыми, имели хорошую генетику, были способны показывать новые результаты, приступив к усиленным тренировкам.
              Такой метод отбора позволил создать широко известную расу sion.
            </p>
            <h2 class="screen__subtitle screen__subtitle_h3">Метод Артура Брико</h2>
            <p class="screen__text">
              Бельгиец проповедовал иной метод получения чемпионов: отсутствие тренировок в первый год жизни, отсутствие взаимодействия с тренером до
              окончания первой линьки, свободные полёты и рост под солнцем в первый год жизни.
            </p>
            <p class="screen__text">
              Плюс селекционный отбор в конце года по экстерьеру, происхождению и пропорциональному развитию. К участию в соревнованиях на расстояниях до 300
              километров птицы допускались в годовалом возрасте и только в хорошую погоду, с обязательным отдыхом после каждых трёх полётов.
            </p>
            <p class="screen__text">
              Брико давал возможность вывести потомство в годовалом возрасте в качестве поощрения за участие в полётах. Второй отбор проходил по результатам
              полётов. Интенсивные тренировки начинались в двухгодовалом возрасте на длинных дистанциях
            </p>
          </div>
          <Navigation :page-next="pageNext" :page-prev="pagePrev"/>
        </div>
      </div>
    </div>
  </main>
</template>

<script>
import {mapActions} from 'vuex'
import Navigation from "@/components/Navigation";
import Doves from "@/components/Doves";
import Logo from "@/components/Logo";
import Background from "@/components/Background";

export default {
  name: "Page-41",
  data() {
    return {
      pagePrev: 'page-40',
      pageNext: 'page-42',
    }
  },
  components: {
    Doves,
    Logo,
    Background,
    Navigation
  },
  mounted() {
    this.animate()
  },
  methods: {
    ...mapActions([
      'animate'
    ]),
  }
}
</script>